## SQL ALIŞTIRMALARI

> ##### ***[Buradaki](https://www.udemy.com/course/python-egitimi/) eğitimde verilen SQL alıştırmaları için benim cevaplarım.***

## Jupyter lab ve db bağlantısı

In [1]:
%load_ext sql
%sql sqlite:///sirket-veri-tabani.db

## Bağlantı kontrol: örnek sorgu

In [2]:
%%sql
SELECT * FROM Customers LIMIT 3;

 * sqlite:///sirket-veri-tabani.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')]

## 1. Orders tablosunda kaç müşteri olduğunu bulunuz.

### Orders tablosu

In [3]:
%%sql
SELECT * FROM Orders LIMIT 5;

 * sqlite:///sirket-veri-tabani.db
Done.

[(10248, 90, 5, '4.07.1996', 3),
 (10249, 81, 6, '5.07.1996', 1),
 (10250, 34, 4, '8.07.1996', 2),
 (10251, 84, 3, '8.07.1996', 1),
 (10252, 76, 4, '9.07.1996', 2)]

**Tablonun CustomerID'lerini saydırırsam, Orders'taki müşteri sayısı ortaya çıkar.**

In [4]:
%%sql
SELECT COUNT(CustomerID) FROM Orders LIMIT 5;

 * sqlite:///sirket-veri-tabani.db
Done.

[(196,)]

## 2. Orders tablosunda kaç tane eşsiz müşteri olduğunu bulunuz.

In [5]:
%%sql
SELECT COUNT(DISTINCT CustomerID) FROM Orders;

 * sqlite:///sirket-veri-tabani.db
Done.

[(74,)]

## 3. Customers tablosunda hangi ülkeden kaçar tane müşteri olduğunu bulunuz.

In [8]:
%%sql
SELECT COUNT(CustomerID) AS musteri_sayisi, Country FROM Customers GROUP BY Country ORDER BY musteri_sayisi DESC;

 * sqlite:///sirket-veri-tabani.db
Done.

[(13, 'USA'),
 (11, 'Germany'),
 (11, 'France'),
 (9, 'Brazil'),
 (7, 'UK'),
 (5, 'Spain'),
 (5, 'Mexico'),
 (4, 'Venezuela'),
 (3, 'Italy'),
 (3, 'Canada'),
 (3, 'Argentina'),
 (2, 'Switzerland'),
 (2, 'Sweden'),
 (2, 'Portugal'),
 (2, 'Finland'),
 (2, 'Denmark'),
 (2, 'Belgium'),
 (2, 'Austria'),
 (1, 'Poland'),
 (1, 'Norway'),
 (1, 'Ireland')]

## 4. Müşterilerden Ülkesi Brezil ya da USA olanları bulunuz.

In [12]:
%%sql
SELECT * FROM  Customers WHERE Country = 'Brazil' OR Country = 'USA' LIMIT 10;

 * sqlite:///sirket-veri-tabani.db
Done.

[(15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil'),
 (21, 'Familia Arquibaldo', 'Aria Cruz', 'Rua Orós, 92', 'São Paulo', '05442-030', 'Brazil'),
 (31, 'Gourmet Lanchonetes', 'André Fonseca', 'Av. Brasil, 442', 'Campinas', '04876-786', 'Brazil'),
 (32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA'),
 (34, 'Hanari Carnes', 'Mario Pontes', 'Rua do Paço, 67', 'Rio de Janeiro', '05454-876', 'Brazil'),
 (36, 'Hungry Coyote Import Store', 'Yoshi Latimer', 'City Center Plaza 516 Main St.', 'Elgin', '97827', 'USA'),
 (43, 'Lazy K Kountry Store', 'John Steel', '12 Orchestra Terrace', 'Walla Walla', '99362', 'USA'),
 (45, "Let's Stop N Shop", 'Jaime Yorres', '87 Polk St. Suite 5', 'San Francisco', '94117', 'USA'),
 (48, 'Lonesome Pine Restaurant', 'Fran Wilson', '89 Chiaroscuro Rd.', 'Portland', '97219', 'USA'),
 (55, 'Old World Delicatessen', 'Rene Phillips', '2743 Bering St.', 'Anchorage', '99508', 'USA')]

## 5. Önce ülkeye göre sonra şehre göre GROUP BY işlemi gerçekleştirin. Ortaya çıkan kırılıma göre müşteri sayısını bulunuz.

In [15]:
%%sql
SELECT COUNT(CustomerID) AS musteri_sayisi, Country FROM Customers GROUP BY Country, City ORDER BY musteri_sayisi DESC LIMIT 5;

 * sqlite:///sirket-veri-tabani.db
Done.

[(6, 'UK'), (5, 'Mexico'), (4, 'Brazil'), (3, 'Argentina'), (3, 'Brazil')]

## 6. Müşterilerin adreslerinin herhangi bir yerinde "da" ifadesi geçen tüm adresleri bulunuz.

In [21]:
%%sql
SELECT * FROM Customers WHERE Address LIKE '%da%';

 * sqlite:///sirket-veri-tabani.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', '5022', 'Mexico'),
 (15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil'),
 (28, 'Furia Bacalhau e Frutos do Mar', 'Lino Rodriguez', 'Jardim das rosas n. 32', 'Lisboa', '1675', 'Portugal'),
 (54, 'Océano Atlántico Ltda.', 'Yvonne Moncada', 'Ing. Gustavo Moncada 8585 Piso 20-A', 'Buenos Aires', '1010', 'Argentina'),
 (60, 'Princesa Isabel Vinhoss', 'Isabel de Castro', 'Estrada da saúde n. 58', 'Lisboa', '1756', 'Portugal'),
 (61, 'Que Delícia', 'Bernardo Batista', 'Rua da Panificadora, 12', 'Rio de Janeiro', '02389-673', 'Brazil'),
 (62, 'Queen Cozinha', 'Lúcia Carvalho', 'Alameda dos Canàrios, 891', 'São Paulo', '05487-020', 'Brazil'),
 (66, 'Reggiani Caseifici', 'Maurizio Moroni', 'Strada Provinciale 124', 'Reggio Emilia', '42100', 'Italy'),
 (80, 'Tortuga Restaurante', 'Miguel Angel Paolino', 'Avda. Azteca 123', 'México D.F.', '5033', 'Mexico'),
 (82, "Trail's Head Gourmet Provisioners", 'Helvetius Nagy', '722 DaVinci Blvd.', 'Kirkland', '98034', 'USA')]

## 7. Germany-Berlin'de yaşayan müşteri/müşterilerin isimleri nelerdir?

In [26]:
%%sql
SELECT * FROM Customers WHERE (Country = 'Germany' AND City = 'Berlin');

 * sqlite:///sirket-veri-tabani.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')]

## 8. Canada'da yaşayıp isimlerinde "in" ifadesi geçen müşteri/müşterileri bulunuz.

In [28]:
%%sql
SELECT * FROM Customers WHERE (Country = 'Canada' AND CustomerName LIKE '%in%');

 * sqlite:///sirket-veri-tabani.db
Done.

[(42, 'Laughing Bacchus Wine Cellars', 'Yoshi Tannamuri', '1900 Oak St.', 'Vancouver', 'V3F 2K1', 'Canada')]

## 9. Fiyatı 40 TL ile 90 TL arasında olan ürünlerin isimleri ve fiyatları nelerdir?

In [33]:
%%sql
SELECT ProductNAME AS urun_ismi, Price AS fiyat FROM Products WHERE Price BETWEEN 40 AND 90 LIMIT 10;

 * sqlite:///sirket-veri-tabani.db
Done.

[('Northwoods Cranberry Sauce', 40),
 ('Genen Shouyu', 43),
 ('Carnarvon Tigers', 62),
 ('Teatime Chocolate Biscuits', 43),
 ("Sir Rodney's Marmalade", 81),
 ('Guaraná Fantástica', 43),
 ('Schoggi Schokolade', 43),
 ('Rössle Sauerkraut', 45),
 ('Geitost', 43),
 ('Boston Crab Meat', 43)]

## 10. Fiyatı 30 TL'den büyük olan ürünlerin isimlerini, fiyatlarını ve fiyatlarının karesini bulunuz.

In [58]:
%%sql
SELECT ProductNAME AS urun_ismi, Price AS urun_fiyati, Price*Price AS urun_fiyatinin_karesi FROM Products WHERE Price > 30 LIMIT 10;

 * sqlite:///sirket-veri-tabani.db
Done.

[('Northwoods Cranberry Sauce', 40, 1600),
 ('Mishi Kobe Niku', 97, 9409),
 ('Ikura', 31, 961),
 ('Queso Manchego La Pastora', 38, 1444),
 ('Genen Shouyu', 43, 1849),
 ('Alice Mutton', 39, 1521),
 ('Carnarvon Tigers', 62, 3844),
 ('Teatime Chocolate Biscuits', 43, 1849),
 ("Sir Rodney's Marmalade", 81, 6561),
 ('Guaraná Fantástica', 43, 1849)]

## 11. Products tablosundaki CategoryID'lerin yani kategorilerin isimleri nelerdir?

In [69]:
%%sql
SELECT DISTINCT Categories.CategoryID, Categories.CategoryNAME FROM Products LEFT OUTER JOIN Categories ON Products.CategoryID = Categories.CategoryID;

 * sqlite:///sirket-veri-tabani.db
Done.

[(1, 'Beverages'),
 (2, 'Condiments'),
 (7, 'Produce'),
 (6, 'Meat/Poultry'),
 (8, 'Seafood'),
 (4, 'Dairy Products'),
 (3, 'Confections'),
 (5, 'Grains/Cereals')]

## 12. Beverages ürün kategorisindeki ürünlerin fiyat ortalaması nedir?

In [74]:
%%sql
SELECT AVG(Price) AS ortalama FROM Products WHERE CategoryID = 1 LIMIT 5;

 * sqlite:///sirket-veri-tabani.db
Done.

[(42.75,)]

## 13. USA'de yaşayan müşterilerin kazandırdığı toplam kazancı bulunuz.

In [93]:
%%sql 
SELECT SUM(Products.Price) FROM Orders 
LEFT JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID 
LEFT JOIN Products ON OrderDetails.ProductID = Products.ProductID 
LEFT JOIN Customers ON Orders.CustomerID = Customers.CustomerID 
WHERE Customers.Country = 'USA';

 * sqlite:///sirket-veri-tabani.db
Done.

[(3762,)]

## 14. Product tablosundaki CategoryID'lerin isimlerini bulunuz akabinde kategori başına ortalama ürün fiyatını gösteriniz.

In [22]:
%%sql 
SELECT CategoryNAME, AVG(Price) FROM Categories
LEFT JOIN Products ON Products.CategoryID = Categories.CategoryID 
GROUP BY Categories.CategoryID;

 * sqlite:///sirket-veri-tabani.db
Done.

[('Beverages', 42.75),
 ('Condiments', 28.25),
 ('Confections', 33.76923076923077),
 ('Dairy Products', 74.9),
 ('Grains/Cereals', 23.571428571428573),
 ('Meat/Poultry', 55.166666666666664),
 ('Produce', 32.2),
 ('Seafood', 26.5)]

## 15. Çalışanları (EmployeeID) isimleri ile birlikte yaptıkları toplam satışlara göre sıralayınız.

In [63]:
%%sql
SELECT Employees.FirstName, SUM(Products.Price) AS toplam_satis FROM Orders 
LEFT JOIN OrderDetails ON OrderDetails.OrderID = Orders.OrderID 
LEFT JOIN Products ON  OrderDetails.ProductID = Products.ProductID
LEFT JOIN Employees ON Employees.EmployeeID = Orders.EmployeeID 
GROUP BY Orders.EmployeeID 
ORDER BY toplam_satis DESC;

 * sqlite:///sirket-veri-tabani.db
Done.

[('Margaret', 5515),
 ('Nancy', 4353),
 ('Janet', 3048),
 ('Michael', 2981),
 ('Laura', 2380),
 ('Robert', 1852),
 ('Andrew', 1550),
 ('Steven', 1408),
 ('Anne', 520)]

## 16. Almanya'dan verilen siparişlerin kategorilerine göre ortalama fiyatları nelerdir?

In [144]:
%%sql 
SELECT CategoryName, AVG(Price) FROM Orders 
LEFT JOIN OrderDetails ON OrderDetails.OrderID = Orders.OrderID  
LEFT JOIN Products ON  OrderDetails.ProductID = Products.ProductID
LEFT JOIN Customers ON  Customers.CustomerID = Orders.CustomerID
LEFT JOIN Categories ON  Categories.CategoryID = Products.CategoryID
WHERE Country = 'Germany' 
GROUP BY Categories.CategoryName;

 * sqlite:///sirket-veri-tabani.db
Done.

[('Beverages', 20.5),
 ('Condiments', 34.0),
 ('Confections', 40.0),
 ('Dairy Products', 151.64705882352942),
 ('Grains/Cereals', 22.142857142857142),
 ('Meat/Poultry', 30.2),
 ('Produce', 30.75),
 ('Seafood', 27.09090909090909)]

## 17. Almanya ya da USA'dan verilen siparişlerin kategorilerine göre ortalama fiyatları nelerdir?

In [170]:
%%sql 
SELECT CategoryName, AVG(Price) FROM Orders 
LEFT JOIN OrderDetails ON OrderDetails.OrderID = Orders.OrderID  
LEFT JOIN Products ON  OrderDetails.ProductID = Products.ProductID
LEFT JOIN Customers ON  Customers.CustomerID = Orders.CustomerID
LEFT JOIN Categories ON  Categories.CategoryID = Products.CategoryID
WHERE Customers.Country = 'USA' OR Customers.Country = 'Germany'
GROUP BY Categories.CategoryName;

 * sqlite:///sirket-veri-tabani.db
Done.

[('Beverages', 29.88888888888889),
 ('Condiments', 34.72727272727273),
 ('Confections', 39.92307692307692),
 ('Dairy Products', 131.75862068965517),
 ('Grains/Cereals', 29.846153846153847),
 ('Meat/Poultry', 46.75),
 ('Produce', 28.625),
 ('Seafood', 25.6)]

## 18. Haziran, Temmuz ve Ağustos aylarında verilen siparişlerin ortalama fiyatları nelerdir?

In [191]:
%%sql 
SELECT AVG(Price) FROM Orders 
LEFT JOIN OrderDetails ON OrderDetails.OrderID = Orders.OrderID  
LEFT JOIN Products ON  OrderDetails.ProductID = Products.ProductID
LEFT JOIN Customers ON  Customers.CustomerID = Orders.CustomerID
LEFT JOIN Categories ON  Categories.CategoryID = Products.CategoryID
WHERE Orders.OrderDate LIKE '%06%' OR Orders.OrderDate LIKE '%07%' OR Orders.OrderDate LIKE '%08%';

 * sqlite:///sirket-veri-tabani.db
Done.

[(42.4765625,)]

## 19. 1997 yılına ait siparişlerin maksimum miktarlarını bulup müşterilerin isimleri ile birlikte büyükten küçüğe sıralayınız.

In [203]:
%%sql 
SELECT CustomerNAME, Price FROM Orders 
LEFT JOIN OrderDetails ON OrderDetails.OrderID = Orders.OrderID  
LEFT JOIN Products ON  OrderDetails.ProductID = Products.ProductID
LEFT JOIN Customers ON  Customers.CustomerID = Orders.CustomerID
LEFT JOIN Categories ON  Categories.CategoryID = Products.CategoryID
WHERE OrderDate LIKE '%1997'
ORDER BY Price DESC LIMIT 10;

 * sqlite:///sirket-veri-tabani.db
Done.

[('Gourmet Lanchonetes', 435),
 ('Simons bistro', 263),
 ('Mère Paillarde', 263),
 ('Eastern Connection', 123),
 ('Save-a-lot Markets', 123),
 ('Wellington Importadora', 97),
 ('Bottom-Dollar Marketse', 55),
 ('Bottom-Dollar Marketse', 55),
 ('Gourmet Lanchonetes', 55),
 ('Ernst Handel', 55)]

## 20. 1997 yılında verilen siparişleri alan çalışanları sipariş alma sayılarına göre sıralayınız.

In [228]:
%%sql 
SELECT Employees.FirstName, COUNT(*) FROM Orders
LEFT JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID 
WHERE OrderDate LIKE '%1997'
GROUP BY Employees.FirstName ORDER by COUNT(*) DESC;

 * sqlite:///sirket-veri-tabani.db
Done.

[('Janet', 13),
 ('Margaret', 9),
 ('Laura', 8),
 ('Andrew', 4),
 ('Robert', 3),
 ('Nancy', 3),
 ('Michael', 3),
 ('Anne', 1)]